cf_billing/DataProcessors/бестЗагрузитьДанныеИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестЗагрузитьДанныеИзВнешнихИсточников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/бестПриборыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПриборыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестУслугиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУслугиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестВидыДифференцированностиПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестВидыДифференцированностиПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестКоэффциентыПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестКоэффциентыПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестПрофильГарантирующегоПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестПрофильГарантирующегоПоставщика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестУсредненныеОбъемы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсредненныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Час</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргВидыКанальности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыКанальности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Шкалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПоУслугам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргВидыДифференцированности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыДифференцированности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормулуРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифныеЗоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормулыРасчетаУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчетаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/бестЗагрузитьДанныеИзВнешнихИсточников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов.
//  ПараметрыПечати			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати.
//  КоллекцияПечатныхФорм	-	см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм.
//  ОбъектыПечати			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати.
//  ПараметрыВывода			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета;
	
	
	Если ИмяМакета = "ШаблонПоказаний" Тогда
		ТабличныйДокумент 		= СформироватьШаблонПоказаний(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ШаблонПочасовогоПотребления" Тогда
		ТабличныйДокумент 		= СформироватьШаблонПочасовогоПотребления(ИмяМакета, ПараметрыПечати);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета, "Шаблон для выгрузки показаний",
		ТабличныйДокумент, ,
		"Обработка.бестЗагрузитьДанныеИзВнешнихИсточников." + ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Загрузить данные почасовой ведомости
//
// Параметры:
//  Дата		 - 	Дата.
//  Организация	 - 	 - 
//  Район		 - 	 - 
//  Услуга		 - 	 - 
//  Файл		 - 	 - 
//  ТЗПоказания	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗагрузитьДанныеПочасовойВедомости(Дата, Организация, Район, Услуга, Файл, ТЗПоказания) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗПоказания.ОбъектРасчетаКод КАК ОбъектРасчетаКод,
	|	ТЗПоказания.ПриборУчетаИзФайла КАК ПриборУчетаИзФайла,
	|	ТЗПоказания.ОбъектРасчетаИзФайла КАК ОбъектРасчетаИзФайла,
	|	ТЗПоказания.ТарифнаяЗонаИзФайла КАК ТарифнаяЗонаИзФайла,
	|	ТЗПоказания.ШкалаИзФайла КАК ШкалаИзФайла,
	|	ТЗПоказания.Показания КАК Показания,
	|	ТЗПоказания.ТочкаУчетаИзФайла КАК ТочкаУчетаИзФайла,
	|	ТЗПоказания.ТарифнаяЗонаКод КАК ТарифнаяЗонаКод,
	|	ТЗПоказания.ШкалаКод КАК ШкалаКод
	|ПОМЕСТИТЬ ВТ_Показания
	|ИЗ
	|	&ТЗПоказания КАК ТЗПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъектыРасчета.Ссылка КАК ОбъектРасчета,
	|	энргПриборыУчетаАбонента.Ссылка КАК ПУ,
	|	энргТарифныеЗоны.Ссылка КАК ТарифнаяЗона,
	|	энргШкалыПриборовУчета.Ссылка КАК Шкала,
	|	ВТ_Показания.ПриборУчетаИзФайла КАК ПриборУчетаИзФайла,
	|	ВТ_Показания.ОбъектРасчетаИзФайла КАК ОбъектРасчетаИзФайла,
	|	ВТ_Показания.ТарифнаяЗонаИзФайла КАК ТарифнаяЗонаИзФайла,
	|	ВТ_Показания.ШкалаИзФайла КАК ШкалаИзФайла,
	|	ВТ_Показания.Показания КАК Показания,
	|	ВТ_Показания.ТочкаУчетаИзФайла КАК ТочкаУчетаИзФайла,
	|	энргТочкиУчета.Ссылка КАК ТочкаУчета,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Услуга КАК Услуга
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ВТ_Показания КАК ВТ_Показания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО ((ВЫРАЗИТЬ(ВТ_Показания.ОбъектРасчетаКод КАК СТРОКА(9))) = бестОбъектыРасчета.Код)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ((ВЫРАЗИТЬ(ВТ_Показания.ПриборУчетаИзФайла КАК СТРОКА(25))) = энргПриборыУчетаАбонента.Код)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТарифныеЗоны КАК энргТарифныеЗоны
	|		ПО ((ВЫРАЗИТЬ(ВТ_Показания.ТарифнаяЗонаКод КАК СТРОКА(9))) = энргТарифныеЗоны.Код)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргШкалыПриборовУчета КАК энргШкалыПриборовУчета
	|		ПО ((ВЫРАЗИТЬ(ВТ_Показания.ШкалаКод КАК СТРОКА(9))) = энргШкалыПриборовУчета.Код)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|		ПО ((ВЫРАЗИТЬ(ВТ_Показания.ТочкаУчетаИзФайла КАК СТРОКА(9))) = энргТочкиУчета.Код)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ УжеСозданныйДокумент
	|ИЗ
	|	Документ.бестЗагруженныеДанныеИзВнешнихИсточников КАК бестЗагруженныеДанныеИзВнешнихИсточников
	|ГДЕ
	|	НЕ бестЗагруженныеДанныеИзВнешнихИсточников.ПометкаУдаления
	|	И бестЗагруженныеДанныеИзВнешнихИсточников.ФайлДляЧтения = &ФайлДляЧтения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ПУ КАК ПриборУчета,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Показания КАК Показания,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Организация КАК Организация,
	|	Итог.Район КАК Район,
	|	Итог.ПериодНачисления КАК ПериодНачисления,
	|	Итог.Услуга КАК Услуга,
	|	ИСТИНА КАК ГотовКОбработке
	|ПОМЕСТИТЬ ЗагруженныеДанные
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	НЕ Итог.ОбъектРасчета ЕСТЬ NULL
	|	И НЕ Итог.ПУ ЕСТЬ NULL
	|	И НЕ Итог.ТарифнаяЗона ЕСТЬ NULL
	|	И НЕ Итог.Шкала ЕСТЬ NULL
	|	И НЕ Итог.ТочкаУчета ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ПУ КАК ПУ,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.Шкала КАК Шкала,
	|	Итог.ПриборУчетаИзФайла КАК ПриборУчетаИзФайла,
	|	Итог.ОбъектРасчетаИзФайла КАК ОбъектРасчетаИзФайла,
	|	Итог.ТарифнаяЗонаИзФайла КАК ТарифнаяЗонаИзФайла,
	|	Итог.ШкалаИзФайла КАК ШкалаИзФайла,
	|	Итог.Показания КАК Показания,
	|	Итог.ТочкаУчетаИзФайла КАК ТочкаУчетаИзФайла,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Организация КАК Организация,
	|	Итог.Район КАК Район,
	|	Итог.ПериодНачисления КАК ПериодНачисления,
	|	Итог.Услуга КАК Услуга,
	|	ЛОЖЬ КАК ГотовКОбработке
	|ПОМЕСТИТЬ НезагруженныеДанные
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	(Итог.ОбъектРасчета ЕСТЬ NULL
	|			ИЛИ Итог.ПУ ЕСТЬ NULL
	|			ИЛИ Итог.ТарифнаяЗона ЕСТЬ NULL
	|			ИЛИ Итог.Шкала ЕСТЬ NULL
	|			ИЛИ Итог.ТочкаУчета ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("ФайлДляЧтения", 		Файл);
	Запрос.УстановитьПараметр("ТЗПоказания", 		ТЗПоказания);
	Запрос.УстановитьПараметр("ПериодНачисления", 	Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Дата, Организация,Район));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Услуга", 			Услуга);
	
	Пакеты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокумент 			= Пакеты[2].Выбрать();
	ВыборкаЗагруженные 			= Пакеты[3].Выбрать();
	ВыборкаНезагруженные 		= Пакеты[4].Выбрать();
	
	Если ВыборкаДокумент.Следующий() Тогда
		ДокументОб = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокументОб.Показания.Очистить();
	Иначе
		ДокументОб = Документы.бестЗагруженныеДанныеИзВнешнихИсточников.СоздатьДокумент();
	КонецЕсли;
	
	
	ДокументОб.Дата 			= Дата;
	ДокументОб.ФайлДляЧтения 	= Файл;
	
	Пока ВыборкаЗагруженные.Следующий() Цикл
		НовСтр = ДокументОб.Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаЗагруженные);
	КонецЦикла;
	
	Пока ВыборкаНезагруженные.Следующий() Цикл
		НовСтр = ДокументОб.Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаНезагруженные);
	КонецЦикла;
	
	Попытка
		ДокументОб.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При создании документа произошла ошибка");
		Возврат Неопределено;
	КонецПопытки;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ создан");
	Возврат ДокументОб.Ссылка;
КонецФункции

Функция ЗагрузитьДанныеПоказанийПирамидыЧерезExcel(Дата, Организация, Файл, ТЗПоказания) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗПоказания.IDСтроки КАК IDСтроки,
	|	ТЗПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТЗПоказания.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ТЗПоказания.Адрес КАК Адрес,
	|	ТЗПоказания.ТипУстройства КАК ТипУстройства,
	|	ТЗПоказания.Показания КАК Показания,
	|	ТЗПоказания.ДатаПоказаний КАК ДатаПоказаний,
	|	ТЗПоказания.СтрокаЗаписана КАК СтрокаЗаписана
	|ПОМЕСТИТЬ ВТ_Показания
	|ИЗ
	|	&ТЗПоказания КАК ТЗПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.IDСтроки КАК IDСтроки,
	|	ТаблицаДанных.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ТаблицаДанных.ДатаПоказаний КАК ДатаПоказаний,
	|	ТаблицаДанных.Адрес КАК Адрес,
	|	ТаблицаДанных.Показания КАК Показания,
	|	энргПриборыУчетаАбонента.Ссылка КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА энргПриборыУчетаАбонента.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПУНайден,
	|	энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная) КАК Шкала
	|ПОМЕСТИТЬ ДанныеНайденныхПУ
	|ИЗ
	|	ВТ_Показания КАК ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ТаблицаДанных.ЗаводскойНомер = энргПриборыУчетаАбонента.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестПриборыТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_ТочкиУчетаПриборов
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(&Период, ) КАК бестПриборыТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеНайденныхПУ.IDСтроки КАК IDСтроки,
	|	ДанныеНайденныхПУ.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ДанныеНайденныхПУ.ДатаПоказаний КАК ДатаПоказаний,
	|	ДанныеНайденныхПУ.Адрес КАК Адрес,
	|	ДанныеНайденныхПУ.Показания КАК Показания,
	|	ДанныеНайденныхПУ.ПриборУчета КАК ПриборУчета,
	|	ДанныеНайденныхПУ.ПУНайден КАК ПУНайден,
	|	ДанныеНайденныхПУ.ВидКанальности КАК ВидКанальности,
	|	ДанныеНайденныхПУ.Шкала КАК Шкала,
	|	ВТ_ТочкиУчетаПриборов.Организация КАК Организация,
	|	ВТ_ТочкиУчетаПриборов.Район КАК Район,
	|	ВТ_ТочкиУчетаПриборов.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ТочкиУчетаПриборов.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_ПромежуточныйИтог
	|ИЗ
	|	ДанныеНайденныхПУ КАК ДанныеНайденныхПУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТочкиУчетаПриборов КАК ВТ_ТочкиУчетаПриборов
	|		ПО ДанныеНайденныхПУ.ПриборУчета = ВТ_ТочкиУчетаПриборов.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестУслугиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			(Организация, Район, ОбъектРасчета, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.ОбъектРасчета,
	|					ВТ.ТочкаУчета
	|				ИЗ
	|					ВТ_ПромежуточныйИтог КАК ВТ)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Район КАК Район,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВТ_ВидДифференцированности
	|ИЗ
	|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			(Организация, Район, ОбъектРасчета, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.ОбъектРасчета,
	|					ВТ.ТочкаУчета
	|				ИЗ
	|					ВТ_ПромежуточныйИтог КАК ВТ)) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПромежуточныйИтог.IDСтроки КАК IDСтроки,
	|	ВТ_ПромежуточныйИтог.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВТ_ПромежуточныйИтог.ДатаПоказаний КАК ДатаПоказаний,
	|	ВТ_ПромежуточныйИтог.Адрес КАК Адрес,
	|	ВТ_ПромежуточныйИтог.Показания КАК Показания,
	|	ВТ_ПромежуточныйИтог.ПриборУчета КАК ПриборУчета,
	|	ВТ_ПромежуточныйИтог.ПУНайден КАК ПУНайден,
	|	ВТ_ПромежуточныйИтог.ВидКанальности КАК ВидКанальности,
	|	ВТ_ПромежуточныйИтог.Шкала КАК Шкала,
	|	ВТ_ПромежуточныйИтог.Организация КАК Организация,
	|	ВТ_ПромежуточныйИтог.Район КАК Район,
	|	ВТ_ПромежуточныйИтог.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ПромежуточныйИтог.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Услуги.Услуга КАК Услуга,
	|	ВТ_ВидДифференцированности.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ВТ_ПромежуточныйИтог КАК ВТ_ПромежуточныйИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Услуги КАК ВТ_Услуги
	|		ПО ВТ_ПромежуточныйИтог.Организация = ВТ_Услуги.Организация
	|			И ВТ_ПромежуточныйИтог.Район = ВТ_Услуги.Район
	|			И ВТ_ПромежуточныйИтог.ОбъектРасчета = ВТ_Услуги.ОбъектРасчета
	|			И ВТ_ПромежуточныйИтог.ТочкаУчета = ВТ_Услуги.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидДифференцированности КАК ВТ_ВидДифференцированности
	|		ПО ВТ_ПромежуточныйИтог.Организация = ВТ_ВидДифференцированности.Организация
	|			И ВТ_ПромежуточныйИтог.Район = ВТ_ВидДифференцированности.Район
	|			И ВТ_ПромежуточныйИтог.ОбъектРасчета = ВТ_ВидДифференцированности.ОбъектРасчета
	|			И ВТ_ПромежуточныйИтог.ТочкаУчета = ВТ_ВидДифференцированности.ТочкаУчета
	|			И ВТ_ПромежуточныйИтог.ПриборУчета = ВТ_ВидДифференцированности.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ УжеСозданныйДокумент
	|ИЗ
	|	Документ.бестЗагруженныеДанныеИзВнешнихИсточников КАК бестЗагруженныеДанныеИзВнешнихИсточников
	|ГДЕ
	|	НЕ бестЗагруженныеДанныеИзВнешнихИсточников.ПометкаУдаления
	|	И бестЗагруженныеДанныеИзВнешнихИсточников.ФайлДляЧтения = &ФайлДляЧтения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.IDСтроки КАК IDСтроки,
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки) КАК ТарифнаяЗона,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Показания КАК Показания,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Организация КАК Организация,
	|	Итог.Район КАК Район,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	Итог.Услуга КАК Услуга,
	|	ИСТИНА КАК ГотовКОбработке,
	|	Итог.ДатаПоказаний КАК ДатаПоказаний
	|ПОМЕСТИТЬ ЗагруженныеДанные
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	Итог.ПУНайден
	|	И Итог.ВидКанальности = ЗНАЧЕНИЕ(Справочник.энргВидыКанальности.Одноканальный)
	|	И Итог.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|	И НЕ Итог.ОбъектРасчета ЕСТЬ NULL
	|	И НЕ Итог.ТочкаУчета ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ПриборУчета КАК ПУ,
	|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки) КАК ТарифнаяЗона,
	|	Итог.Шкала КАК Шкала,
	|	Итог.ЗаводскойНомер КАК ПриборУчетаИзФайла,
	|	"""" КАК ОбъектРасчетаИзФайла,
	|	"""" КАК ТарифнаяЗонаИзФайла,
	|	"""" КАК ШкалаИзФайла,
	|	Итог.Показания КАК Показания,
	|	"""" КАК ТочкаУчетаИзФайла,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Организация КАК Организация,
	|	Итог.Район КАК Район,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	Итог.Услуга КАК Услуга,
	|	ЛОЖЬ КАК ГотовКОбработке
	|ПОМЕСТИТЬ НезагруженныеДанные
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	НЕ Итог.IDСтроки В
	|				(ВЫБРАТЬ
	|					ЗагруженныеДанные.IDСтроки КАК IDСтроки
	|				ИЗ
	|					ЗагруженныеДанные КАК ЗагруженныеДанные)";
	
	Запрос.УстановитьПараметр("ФайлДляЧтения", 		Файл);
	Запрос.УстановитьПараметр("ТЗПоказания", 		ТЗПоказания);
	Запрос.УстановитьПараметр("ПериодНачисления", 	Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Дата, Организация, Справочники.энргЗоныОтвественности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Организация", 		Организация); 
	Запрос.УстановитьПараметр("Период", 			Дата);
	
	Пакеты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДокумент 			= Пакеты[Пакеты.Количество() - 3].Выбрать();
	ВыборкаЗагруженные 			= Пакеты[Пакеты.Количество() - 2].Выбрать();
	ВыборкаНезагруженные 		= Пакеты[Пакеты.Количество() - 1].Выбрать();
	
	Если ВыборкаДокумент.Следующий() Тогда
		ДокументОб = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокументОб.Показания.Очистить();
	Иначе
		ДокументОб = Документы.бестЗагруженныеДанныеИзВнешнихИсточников.СоздатьДокумент();
	КонецЕсли;
	
	
	ДокументОб.Дата 			= Дата;
	ДокументОб.ФайлДляЧтения 	= Файл;
	
	Пока ВыборкаЗагруженные.Следующий() Цикл
		НовСтр = ДокументОб.Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаЗагруженные);
	КонецЦикла;
	
	Пока ВыборкаНезагруженные.Следующий() Цикл
		НовСтр = ДокументОб.Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаНезагруженные);
	КонецЦикла;
	
	Попытка
		ДокументОб.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При создании документа произошла ошибка");
		Возврат Неопределено;
	КонецПопытки;
	Возврат ДокументОб.Ссылка;
КонецФункции

Функция ЗагрузитьДанныеГП(Дата, Организация, Услуга, Поставщик, ПутьКФайлу, ТЗУсредненныеОбъемы) Экспорт
	ПрофильГП 					= Документы.бестПрофильГарантирующегоПоставщика.СоздатьДокумент();
	ПрофильГП.Дата 				= ТекущаяДата();
	ПрофильГП.Организация 		= Организация;
	ПрофильГП.ПериодНачисления 	= Дата;
	ПрофильГП.Услуга 			= Услуга;
	ПрофильГП.ФайлДляЧтения 	= ПутьКФайлу;
	ПрофильГП.Поставщик 		= Поставщик;
	
	Для каждого стр из ТЗУсредненныеОбъемы Цикл
		НовСтр = ПрофильГП.УсредненныеОбъемы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
	КонецЦикла;
	
	Попытка
		ПрофильГП.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ создан");
		Возврат ПрофильГП.Ссылка;
	Исключение 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При создании документа произошла ошибка");
		Возврат Неопределено;
	КонецПопытки;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьШаблонПоказаний(ИмяМакета, ПараметрыПечати)
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Обработка.бестЗагрузитьДанныеИзВнешнихИсточников." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	мОбъектовРасчета = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(ПараметрыПечати.Организация, ПараметрыПечати.Район, ПараметрыПечати.Дата, ПараметрыПечати.Договор).Выгрузить().ВыгрузитьКолонку("ОбъектРасчета");
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(ПараметрыПечати.Дата,ПараметрыПечати.Организация,ПараметрыПечати.Район,мОбъектовРасчета,,,МВТ,Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК EmailКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация2.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация3.Представление КАК ФаксКонтрагента
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация2
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация2.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация2.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация3
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация3.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация3.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ОтборПоУслуге
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	Итог.Услуга = &Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтборПоУслуге.ОбъектРасчета КАК НаименованиеОбъекта,
	|	ОтборПоУслуге.Шкала КАК Шкала,
	|	ОтборПоУслуге.Услуга КАК Услуга,
	|	ОтборПоУслуге.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОтборПоУслуге.ПриборУчета КАК ПУ,
	|	ЕСТЬNULL(бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент, 0) КАК КоэфТрансформации,
	|	бестОбъектыРасчета.Код КАК КодОбъекта,
	|	энргШкалыПриборовУчета.Код КАК ШкалаКод,
	|	энргТарифныеЗоны.Код КАК ТарифнаяЗонаКод,
	|	энргТочкиУчета.Код КАК КодТУ
	|ИЗ
	|	ОтборПоУслуге КАК ОтборПоУслуге
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестКоэффциентыПриборовУчетаНПСрезПоследних
	|		ПО ОтборПоУслуге.ТочкаУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И (бестКоэффциентыПриборовУчетаНПСрезПоследних.ПриборУчета = ОтборПоУслуге.ПриборУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО ОтборПоУслуге.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргШкалыПриборовУчета КАК энргШкалыПриборовУчета
	|		ПО ОтборПоУслуге.Шкала = энргШкалыПриборовУчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТарифныеЗоны КАК энргТарифныеЗоны
	|		ПО ОтборПоУслуге.ТарифнаяЗона = энргТарифныеЗоны.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|		ПО ОтборПоУслуге.ТочкаУчета = энргТочкиУчета.Ссылка";
	
	Запрос.УстановитьПараметр("Организация",ПараметрыПечати.Организация);
	Запрос.УстановитьПараметр("Период", 	ПараметрыПечати.Дата);
	Запрос.УстановитьПараметр("Район", 		ПараметрыПечати.Район);
	Запрос.УстановитьПараметр("Услуга",		ПараметрыПечати.Услуга);
	Запрос.УстановитьПараметр("Договор",	ПараметрыПечати.Договор);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 	= РезультатЗапроса[0].Выбрать();
	ВыборкаДанные 		= РезультатЗапроса[2].Выбрать();
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
		
		
		ПодписантКонтрагента = ПараметрыПечати.ПодписантКонтрагента;
		ОбластьПодвал.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
		ОбластьПодвал.Параметры.ПодписантКонтрагента = ПодписантКонтрагента;
		ОбластьПодвал.Параметры.ДолжностьПодписантаКонтрагента = ПодписантКонтрагента.Должность;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Пока ВыборкаДанные.Следующий() Цикл
		ОбластьСтрокаПоказаний = Макет.ПолучитьОбласть("СтрокаПоказаний");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоказаний.Параметры,ВыборкаДанные);
		ТабДок.Вывести(ОбластьСтрокаПоказаний);
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	Возврат ТабДок;
КонецФункции

Функция СформироватьШаблонПочасовогоПотребления(ИмяМакета, ПараметрыПечати)
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Обработка.бестЗагрузитьДанныеИзВнешнихИсточников." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Результат = РегистрыСведений.бестПриборыТочекУчетаНП.ПолучитьДанныеПрибораУчета(ПараметрыПечати.Организация, ПараметрыПечати.Район, ПараметрыПечати.Дата,,,ПараметрыПечати.ТочкаУчета);
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбластьШапка.Параметры.ПУ 		= Выборка.ПриборУчета;
	КонецЕсли;
	
	Если ПараметрыПечати.ВидОперации = Перечисления.бестВидыОпераций.ПочасоваяВедомость_ПлановоеПотребление Тогда
		ОбластьШапка.Параметры.Заголовок 		= "Отчет о плановом почасовом объеме потребления электрической энергии (форма) для потребителей, рассчитывающихся с 5-6 ценовым категориям";
		ОбластьШапка.Параметры.НомерПриложения 	= "ПРИЛОЖЕНИЕ 2.3.";
		ОбластьПодвал.Параметры.Примечение 		= "Примечание:" + Символы.ПС + "1. Плановое почасовое потребление электроэнергии (ППП) ""Потребителя"" формируется отдельно по каждому объекту электроснабжения, в объемы ППП включаются объемы потребления субабонентов." + Символы.ПС +  "2. В объемы данного Приложения не включаются: объемы транзита электроэнергии в сети Сетевой организации.";
	Иначе
		ОбластьШапка.Параметры.Заголовок 		= "Отчет о почасовом потреблении электрической энергии (форма) для объектов потребителей, рассчитывающихся с 3-6 ценовым категориям";
		ОбластьШапка.Параметры.НомерПриложения 	= "ПРИЛОЖЕНИЕ 4.1.";
		ОбластьПодвал.Параметры.Примечение 		= "Примечание: В случае если на энергоснабжаемом объекте установлены несколько приборов учета электрической энергии, то потребитель обязуется предоставлять отчет о расходе электрической энергии и мощности с расшифровкой почасовых объемов потребления, в том числе в целом по объекту.";
	КонецЕсли;
	
	
	ОбластьШапка.Параметры.ТочкаУчета 				= ПараметрыПечати.ТочкаУчета;
	ОбластьШапка.Параметры.КодТУ 					= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.ТочкаУчета, "Код");
	ОбластьШапка.Параметры.Период 					= Формат(ПараметрыПечати.Дата, "ДЛФ=D");
	ОбластьШапка.Параметры.Контрагент 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.Договор, "Контрагент");
	ОбластьШапка.Параметры.НомерДоговора 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.Договор, "Номер");
	ОбластьШапка.Параметры.ДатаДоговора 			= Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.Договор, "Дата"), "ДЛФ=D");
	
	ОбластьПодвал.Параметры.Контрагент 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.Договор, "Контрагент");
	ОбластьПодвал.Параметры.Организация 			= ПараметрыПечати.Организация;
	
	ТабДок.Вывести(ОбластьШапка);
	
	пДень = НачалоМесяца(ПараметрыПечати.Дата);
	
	Пока Месяц(ПараметрыПечати.Дата) = Месяц(пДень) Цикл
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры.День 			= Формат(пДень,"ДЛФ=D");
		ТабДок.Вывести(ОбластьДанные);
		пДень = пДень + 86400;
	КонецЦикла;
	
	
	ПодписантКонтрагента = ПараметрыПечати.ПодписантКонтрагента;
	ОбластьПодвал.Параметры.ПодписантКонтрагента = ПодписантКонтрагента;
	ОбластьПодвал.Параметры.ДолжностьПодписантаКонтрагента = ПодписантКонтрагента.Должность;
	ТабДок.Вывести(ОбластьПодвал);
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#КонецЕсли
